<center> <h1># WELCOME TO PANDAS <h1><center>

In [153]:
import pandas as pd

## 2 main datatypes
- Series
- dataframes

In [154]:
series = pd.Series(["BMW","lamborgini","Buggati"])

In [155]:
series

0           BMW
1    lamborgini
2       Buggati
dtype: object

### Series = 1 D

In [156]:
color = pd.Series(["Red","Blue","White"])
color

0      Red
1     Blue
2    White
dtype: object

# DATAFRAME = 2 D

In [157]:
car_data = pd.DataFrame({"Car_Brand" : series,"Car_Color" : color})
car_data

    Car_Brand Car_Color
0         BMW       Red
1  lamborgini      Blue
2     Buggati     White

### importing data

In [158]:
car_sales = pd.read_csv("car-sales.csv")

In [159]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## exporting dataframe

In [160]:
car_sales.to_csv("exported-car-sales.csv", index = False)

In [161]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")

In [162]:
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## **Data from URLs**

In [163]:
heart_disease = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/heart-disease.csv")

In [164]:
heart_disease.head(10)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
5,57,1,0,140,192,0,1,148,0,0.4,1,0,1,1
6,56,0,1,140,294,0,0,153,0,1.3,1,0,2,1
7,44,1,1,120,263,0,1,173,0,0.0,2,0,3,1
8,52,1,2,172,199,1,1,162,0,0.5,2,0,3,1
9,57,1,2,150,168,0,1,174,0,1.6,2,0,2,1

## Describe Data

In [165]:
# Attribute
car_sales.dtypes
#Function
# pd.read_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [166]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [167]:
car_columns = car_sales.columns

In [168]:
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [169]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [170]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [171]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [172]:
car_prices = pd.Series([100,0,50])

In [173]:
car_prices

0    100
1      0
2     50
dtype: int64

In [174]:
car_prices.mean()

50.0

In [175]:
car_sales["Doors"].sum()

40

-----------------------------------------------------------------------------------------

### erorr sol.

In [176]:
# car_sales.mean() give's error
#this works
car_sales["Doors"].mean()

4.0

-------------------------------------------------------------

In [177]:
len(car_sales)

10

--------------------------------------------------------------------
## Veiwing & Selecting Data

In [178]:
# car_sales.head() = car_sales.head(5)
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [179]:
# car_sales.tail() = car_sales.tail(5)
car_sales.tail(7)

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

### .loc & .iloc

In [180]:
languages = pd.Series(["Assembly","C++","TS","Python","JS"],index=[0,3,3,4,5])

In [181]:
languages.loc[0]

'Assembly'

In [186]:
# .loc refers to index
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [187]:
# .iloc refers to position
languages.iloc[3]

'Python'

In [184]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [193]:
languages.iloc[:3]

0    Assembly
3         C++
3          TS
dtype: object

In [ ]:
car_sales